Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; RP2350_otp_data_raw.
; ====================

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		RP2350_otp_data_raw equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

#include	<stdint.h>

// OTP_DATA_RAW address definitions
// --------------------------------

typedef struct {
	volatile	uint32_t	CHIPID0;
	volatile	uint32_t	CHIPID1;
	volatile	uint32_t	CHIPID2;
	volatile	uint32_t	CHIPID3;
	volatile	uint32_t	RANDID0;
	volatile	uint32_t	RANDID1;
	volatile	uint32_t	RANDID2;
	volatile	uint32_t	RANDID3;
	volatile	uint32_t	RANDID4;
	volatile	uint32_t	RANDID5;
	volatile	uint32_t	RANDID6;
	volatile	uint32_t	RANDID7;
	volatile	uint32_t	RESERVED0[4];
	volatile	uint32_t	ROSC_CALIB;
	volatile	uint32_t	LPOSC_CALIB;
	volatile	uint32_t	RESERVED1[6];
	volatile	uint32_t	NUM_GPIOS;
	volatile	uint32_t	RESERVED2[29];
	volatile	uint32_t	INFO_CRC0;
	volatile	uint32_t	INFO_CRC1;
	volatile	uint32_t	CRIT0;
	volatile	uint32_t	CRIT0_R1;
	volatile	uint32_t	CRIT0_R2;
	volatile	uint32_t	CRIT0_R3;
	volatile	uint32_t	CRIT0_R4;
	volatile	uint32_t	CRIT0_R5;
	volatile	uint32_t	CRIT0_R6;
	volatile	uint32_t	CRIT0_R7;
	volatile	uint32_t	CRIT1;
	volatile	uint32_t	CRIT1_R1;
	volatile	uint32_t	CRIT1_R2;
	volatile	uint32_t	CRIT1_R3;
	volatile	uint32_t	CRIT1_R4;
	volatile	uint32_t	CRIT1_R5;
	volatile	uint32_t	CRIT1_R6;
	volatile	uint32_t	CRIT1_R7;
	volatile	uint32_t	BOOT_FLAGS0;
	volatile	uint32_t	BOOT_FLAGS0_R1;
	volatile	uint32_t	BOOT_FLAGS0_R2;
	volatile	uint32_t	BOOT_FLAGS1;
	volatile	uint32_t	BOOT_FLAGS1_R1;
	volatile	uint32_t	BOOT_FLAGS1_R2;
	volatile	uint32_t	DEFAULT_BOOT_VERSION0;
	volatile	uint32_t	DEFAULT_BOOT_VERSION0_R1;
	volatile	uint32_t	DEFAULT_BOOT_VERSION0_R2;
	volatile	uint32_t	DEFAULT_BOOT_VERSION1;
	volatile	uint32_t	DEFAULT_BOOT_VERSION1_R1;
	volatile	uint32_t	DEFAULT_BOOT_VERSION1_R2;
	volatile	uint32_t	FLASH_DEVINFO;
	volatile	uint32_t	FLASH_PARTITION_SLOT_SIZE;
	volatile	uint32_t	BOOTSEL_LED_CFG;
	volatile	uint32_t	BOOTSEL_PLL_CFG;
	volatile	uint32_t	BOOTSEL_XOSC_CFG;
	volatile	uint32_t	USB_BOOT_FLAGS;
	volatile	uint32_t	USB_BOOT_FLAGS_R1;
	volatile	uint32_t	USB_BOOT_FLAGS_R2;
	volatile	uint32_t	USB_WHITE_LABEL_ADDR;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	OTPBOOT_SRC;
	volatile	uint32_t	OTPBOOT_LEN;
	volatile	uint32_t	OTPBOOT_DST0;
	volatile	uint32_t	OTPBOOT_DST1;
	volatile	uint32_t	RESERVED4[30];
	volatile	uint32_t	BOOTKEY0_0;
	volatile	uint32_t	BOOTKEY0_1;
	volatile	uint32_t	BOOTKEY0_2;
	volatile	uint32_t	BOOTKEY0_3;
	volatile	uint32_t	BOOTKEY0_4;
	volatile	uint32_t	BOOTKEY0_5;
	volatile	uint32_t	BOOTKEY0_6;
	volatile	uint32_t	BOOTKEY0_7;
	volatile	uint32_t	BOOTKEY0_8;
	volatile	uint32_t	BOOTKEY0_9;
	volatile	uint32_t	BOOTKEY0_10;
	volatile	uint32_t	BOOTKEY0_11;
	volatile	uint32_t	BOOTKEY0_12;
	volatile	uint32_t	BOOTKEY0_13;
	volatile	uint32_t	BOOTKEY0_14;
	volatile	uint32_t	BOOTKEY0_15;
	volatile	uint32_t	BOOTKEY1_0;
	volatile	uint32_t	BOOTKEY1_1;
	volatile	uint32_t	BOOTKEY1_2;
	volatile	uint32_t	BOOTKEY1_3;
	volatile	uint32_t	BOOTKEY1_4;
	volatile	uint32_t	BOOTKEY1_5;
	volatile	uint32_t	BOOTKEY1_6;
	volatile	uint32_t	BOOTKEY1_7;
	volatile	uint32_t	BOOTKEY1_8;
	volatile	uint32_t	BOOTKEY1_9;
	volatile	uint32_t	BOOTKEY1_10;
	volatile	uint32_t	BOOTKEY1_11;
	volatile	uint32_t	BOOTKEY1_12;
	volatile	uint32_t	BOOTKEY1_13;
	volatile	uint32_t	BOOTKEY1_14;
	volatile	uint32_t	BOOTKEY1_15;
	volatile	uint32_t	BOOTKEY2_0;
	volatile	uint32_t	BOOTKEY2_1;
	volatile	uint32_t	BOOTKEY2_2;
	volatile	uint32_t	BOOTKEY2_3;
	volatile	uint32_t	BOOTKEY2_4;
	volatile	uint32_t	BOOTKEY2_5;
	volatile	uint32_t	BOOTKEY2_6;
	volatile	uint32_t	BOOTKEY2_7;
	volatile	uint32_t	BOOTKEY2_8;
	volatile	uint32_t	BOOTKEY2_9;
	volatile	uint32_t	BOOTKEY2_10;
	volatile	uint32_t	BOOTKEY2_11;
	volatile	uint32_t	BOOTKEY2_12;
	volatile	uint32_t	BOOTKEY2_13;
	volatile	uint32_t	BOOTKEY2_14;
	volatile	uint32_t	BOOTKEY2_15;
	volatile	uint32_t	BOOTKEY3_0;
	volatile	uint32_t	BOOTKEY3_1;
	volatile	uint32_t	BOOTKEY3_2;
	volatile	uint32_t	BOOTKEY3_3;
	volatile	uint32_t	BOOTKEY3_4;
	volatile	uint32_t	BOOTKEY3_5;
	volatile	uint32_t	BOOTKEY3_6;
	volatile	uint32_t	BOOTKEY3_7;
	volatile	uint32_t	BOOTKEY3_8;
	volatile	uint32_t	BOOTKEY3_9;
	volatile	uint32_t	BOOTKEY3_10;
	volatile	uint32_t	BOOTKEY3_11;
	volatile	uint32_t	BOOTKEY3_12;
	volatile	uint32_t	BOOTKEY3_13;
	volatile	uint32_t	BOOTKEY3_14;
	volatile	uint32_t	BOOTKEY3_15;
	volatile	uint32_t	RESERVED5[3720];
	volatile	uint32_t	KEY1_0;
	volatile	uint32_t	KEY1_1;
	volatile	uint32_t	KEY1_2;
	volatile	uint32_t	KEY1_3;
	volatile	uint32_t	KEY1_4;
	volatile	uint32_t	KEY1_5;
	volatile	uint32_t	KEY1_6;
	volatile	uint32_t	KEY1_7;
	volatile	uint32_t	KEY2_0;
	volatile	uint32_t	KEY2_1;
	volatile	uint32_t	KEY2_2;
	volatile	uint32_t	KEY2_3;
	volatile	uint32_t	KEY2_4;
	volatile	uint32_t	KEY2_5;
	volatile	uint32_t	KEY2_6;
	volatile	uint32_t	KEY2_7;
	volatile	uint32_t	KEY3_0;
	volatile	uint32_t	KEY3_1;
	volatile	uint32_t	KEY3_2;
	volatile	uint32_t	KEY3_3;
	volatile	uint32_t	KEY3_4;
	volatile	uint32_t	KEY3_5;
	volatile	uint32_t	KEY3_6;
	volatile	uint32_t	KEY3_7;
	volatile	uint32_t	KEY4_0;
	volatile	uint32_t	KEY4_1;
	volatile	uint32_t	KEY4_2;
	volatile	uint32_t	KEY4_3;
	volatile	uint32_t	KEY4_4;
	volatile	uint32_t	KEY4_5;
	volatile	uint32_t	KEY4_6;
	volatile	uint32_t	KEY4_7;
	volatile	uint32_t	KEY5_0;
	volatile	uint32_t	KEY5_1;
	volatile	uint32_t	KEY5_2;
	volatile	uint32_t	KEY5_3;
	volatile	uint32_t	KEY5_4;
	volatile	uint32_t	KEY5_5;
	volatile	uint32_t	KEY5_6;
	volatile	uint32_t	KEY5_7;
	volatile	uint32_t	KEY6_0;
	volatile	uint32_t	KEY6_1;
	volatile	uint32_t	KEY6_2;
	volatile	uint32_t	KEY6_3;
	volatile	uint32_t	KEY6_4;
	volatile	uint32_t	KEY6_5;
	volatile	uint32_t	KEY6_6;
	volatile	uint32_t	KEY6_7;
	volatile	uint32_t	RESERVED6;
	volatile	uint32_t	KEY1_VALID;
	volatile	uint32_t	KEY2_VALID;
	volatile	uint32_t	KEY3_VALID;
	volatile	uint32_t	KEY4_VALID;
	volatile	uint32_t	KEY5_VALID;
	volatile	uint32_t	KEY6_VALID;
	volatile	uint32_t	RESERVED7;
	volatile	uint32_t	PAGE0_LOCK0;
	volatile	uint32_t	PAGE0_LOCK1;
	volatile	uint32_t	PAGE1_LOCK0;
	volatile	uint32_t	PAGE1_LOCK1;
	volatile	uint32_t	PAGE2_LOCK0;
	volatile	uint32_t	PAGE2_LOCK1;
	volatile	uint32_t	PAGE3_LOCK0;
	volatile	uint32_t	PAGE3_LOCK1;
	volatile	uint32_t	PAGE4_LOCK0;
	volatile	uint32_t	PAGE4_LOCK1;
	volatile	uint32_t	PAGE5_LOCK0;
	volatile	uint32_t	PAGE5_LOCK1;
	volatile	uint32_t	PAGE6_LOCK0;
	volatile	uint32_t	PAGE6_LOCK1;
	volatile	uint32_t	PAGE7_LOCK0;
	volatile	uint32_t	PAGE7_LOCK1;
	volatile	uint32_t	PAGE8_LOCK0;
	volatile	uint32_t	PAGE8_LOCK1;
	volatile	uint32_t	PAGE9_LOCK0;
	volatile	uint32_t	PAGE9_LOCK1;
	volatile	uint32_t	PAGE10_LOCK0;
	volatile	uint32_t	PAGE10_LOCK1;
	volatile	uint32_t	PAGE11_LOCK0;
	volatile	uint32_t	PAGE11_LOCK1;
	volatile	uint32_t	PAGE12_LOCK0;
	volatile	uint32_t	PAGE12_LOCK1;
	volatile	uint32_t	PAGE13_LOCK0;
	volatile	uint32_t	PAGE13_LOCK1;
	volatile	uint32_t	PAGE14_LOCK0;
	volatile	uint32_t	PAGE14_LOCK1;
	volatile	uint32_t	PAGE15_LOCK0;
	volatile	uint32_t	PAGE15_LOCK1;
	volatile	uint32_t	PAGE16_LOCK0;
	volatile	uint32_t	PAGE16_LOCK1;
	volatile	uint32_t	PAGE17_LOCK0;
	volatile	uint32_t	PAGE17_LOCK1;
	volatile	uint32_t	PAGE18_LOCK0;
	volatile	uint32_t	PAGE18_LOCK1;
	volatile	uint32_t	PAGE19_LOCK0;
	volatile	uint32_t	PAGE19_LOCK1;
	volatile	uint32_t	PAGE20_LOCK0;
	volatile	uint32_t	PAGE20_LOCK1;
	volatile	uint32_t	PAGE21_LOCK0;
	volatile	uint32_t	PAGE21_LOCK1;
	volatile	uint32_t	PAGE22_LOCK0;
	volatile	uint32_t	PAGE22_LOCK1;
	volatile	uint32_t	PAGE23_LOCK0;
	volatile	uint32_t	PAGE23_LOCK1;
	volatile	uint32_t	PAGE24_LOCK0;
	volatile	uint32_t	PAGE24_LOCK1;
	volatile	uint32_t	PAGE25_LOCK0;
	volatile	uint32_t	PAGE25_LOCK1;
	volatile	uint32_t	PAGE26_LOCK0;
	volatile	uint32_t	PAGE26_LOCK1;
	volatile	uint32_t	PAGE27_LOCK0;
	volatile	uint32_t	PAGE27_LOCK1;
	volatile	uint32_t	PAGE28_LOCK0;
	volatile	uint32_t	PAGE28_LOCK1;
	volatile	uint32_t	PAGE29_LOCK0;
	volatile	uint32_t	PAGE29_LOCK1;
	volatile	uint32_t	PAGE30_LOCK0;
	volatile	uint32_t	PAGE30_LOCK1;
	volatile	uint32_t	PAGE31_LOCK0;
	volatile	uint32_t	PAGE31_LOCK1;
	volatile	uint32_t	PAGE32_LOCK0;
	volatile	uint32_t	PAGE32_LOCK1;
	volatile	uint32_t	PAGE33_LOCK0;
	volatile	uint32_t	PAGE33_LOCK1;
	volatile	uint32_t	PAGE34_LOCK0;
	volatile	uint32_t	PAGE34_LOCK1;
	volatile	uint32_t	PAGE35_LOCK0;
	volatile	uint32_t	PAGE35_LOCK1;
	volatile	uint32_t	PAGE36_LOCK0;
	volatile	uint32_t	PAGE36_LOCK1;
	volatile	uint32_t	PAGE37_LOCK0;
	volatile	uint32_t	PAGE37_LOCK1;
	volatile	uint32_t	PAGE38_LOCK0;
	volatile	uint32_t	PAGE38_LOCK1;
	volatile	uint32_t	PAGE39_LOCK0;
	volatile	uint32_t	PAGE39_LOCK1;
	volatile	uint32_t	PAGE40_LOCK0;
	volatile	uint32_t	PAGE40_LOCK1;
	volatile	uint32_t	PAGE41_LOCK0;
	volatile	uint32_t	PAGE41_LOCK1;
	volatile	uint32_t	PAGE42_LOCK0;
	volatile	uint32_t	PAGE42_LOCK1;
	volatile	uint32_t	PAGE43_LOCK0;
	volatile	uint32_t	PAGE43_LOCK1;
	volatile	uint32_t	PAGE44_LOCK0;
	volatile	uint32_t	PAGE44_LOCK1;
	volatile	uint32_t	PAGE45_LOCK0;
	volatile	uint32_t	PAGE45_LOCK1;
	volatile	uint32_t	PAGE46_LOCK0;
	volatile	uint32_t	PAGE46_LOCK1;
	volatile	uint32_t	PAGE47_LOCK0;
	volatile	uint32_t	PAGE47_LOCK1;
	volatile	uint32_t	PAGE48_LOCK0;
	volatile	uint32_t	PAGE48_LOCK1;
	volatile	uint32_t	PAGE49_LOCK0;
	volatile	uint32_t	PAGE49_LOCK1;
	volatile	uint32_t	PAGE50_LOCK0;
	volatile	uint32_t	PAGE50_LOCK1;
	volatile	uint32_t	PAGE51_LOCK0;
	volatile	uint32_t	PAGE51_LOCK1;
	volatile	uint32_t	PAGE52_LOCK0;
	volatile	uint32_t	PAGE52_LOCK1;
	volatile	uint32_t	PAGE53_LOCK0;
	volatile	uint32_t	PAGE53_LOCK1;
	volatile	uint32_t	PAGE54_LOCK0;
	volatile	uint32_t	PAGE54_LOCK1;
	volatile	uint32_t	PAGE55_LOCK0;
	volatile	uint32_t	PAGE55_LOCK1;
	volatile	uint32_t	PAGE56_LOCK0;
	volatile	uint32_t	PAGE56_LOCK1;
	volatile	uint32_t	PAGE57_LOCK0;
	volatile	uint32_t	PAGE57_LOCK1;
	volatile	uint32_t	PAGE58_LOCK0;
	volatile	uint32_t	PAGE58_LOCK1;
	volatile	uint32_t	PAGE59_LOCK0;
	volatile	uint32_t	PAGE59_LOCK1;
	volatile	uint32_t	PAGE60_LOCK0;
	volatile	uint32_t	PAGE60_LOCK1;
	volatile	uint32_t	PAGE61_LOCK0;
	volatile	uint32_t	PAGE61_LOCK1;
	volatile	uint32_t	PAGE62_LOCK0;
	volatile	uint32_t	PAGE62_LOCK1;
	volatile	uint32_t	PAGE63_LOCK0;
	volatile	uint32_t	PAGE63_LOCK1;
} OTP_DATA_RAW_TypeDef;

#ifdef __cplusplus
#define	OTP_DATA_RAW_NS	reinterpret_cast<OTP_DATA_RAW_TypeDef *>(0x40134000u)
#define	OTP_DATA_RAW_S	reinterpret_cast<OTP_DATA_RAW_TypeDef *>(0x40134000u)
#else
#define	OTP_DATA_RAW_NS	((OTP_DATA_RAW_TypeDef *)0x40134000u)
#define	OTP_DATA_RAW_S	((OTP_DATA_RAW_TypeDef *)0x40134000u)
#endif

// CHIPID0 Configuration

#define	OTP_DATA_RAW_CHIPID0_CHIPID0																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_CHIPID0_CHIPID0_0																			(0x1u<<0)

// CHIPID1 Configuration

#define	OTP_DATA_RAW_CHIPID1_CHIPID1																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_CHIPID1_CHIPID1_0																			(0x1u<<0)

// CHIPID2 Configuration

