Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
#define	OTP_DATA_RAW_CHIPID2_CHIPID2																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_CHIPID2_CHIPID2_0																			(0x1u<<0)

// CHIPID3 Configuration

#define	OTP_DATA_RAW_CHIPID3_CHIPID3																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_CHIPID3_CHIPID3_0																			(0x1u<<0)

// RANDID0 Configuration

#define	OTP_DATA_RAW_RANDID0_RANDID0																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID0_RANDID0_0																			(0x1u<<0)

// RANDID1 Configuration

#define	OTP_DATA_RAW_RANDID1_RANDID1																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID1_RANDID1_0																			(0x1u<<0)

// RANDID2 Configuration

#define	OTP_DATA_RAW_RANDID2_RANDID2																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID2_RANDID2_0																			(0x1u<<0)

// RANDID3 Configuration

#define	OTP_DATA_RAW_RANDID3_RANDID3																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID3_RANDID3_0																			(0x1u<<0)

// RANDID4 Configuration

#define	OTP_DATA_RAW_RANDID4_RANDID4																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID4_RANDID4_0																			(0x1u<<0)

// RANDID5 Configuration

#define	OTP_DATA_RAW_RANDID5_RANDID5																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID5_RANDID5_0																			(0x1u<<0)

// RANDID6 Configuration

#define	OTP_DATA_RAW_RANDID6_RANDID6																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID6_RANDID6_0																			(0x1u<<0)

// RANDID7 Configuration

#define	OTP_DATA_RAW_RANDID7_RANDID7																			(0xFFFFu<<0)
#define	OTP_DATA_RAW_RANDID7_RANDID7_0																			(0x1u<<0)

// ROSC_CALIB Configuration

#define	OTP_DATA_RAW_ROSC_CALIB_ROSC_CALIB																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_ROSC_CALIB_ROSC_CALIB_0																	(0x1u<<0)

// LPOSC_CALIB Configuration

#define	OTP_DATA_RAW_LPOSC_CALIB_LPOSC_CALIB																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_LPOSC_CALIB_LPOSC_CALIB_0																	(0x1u<<0)

// NUM_GPIOS Configuration

#define	OTP_DATA_RAW_NUM_GPIOS_NUM_GPIOS																		(0xFFu<<0)
#define	OTP_DATA_RAW_NUM_GPIOS_NUM_GPIOS_0																		(0x1u<<0)

// INFO_CRC0 Configuration

#define	OTP_DATA_RAW_INFO_CRC0_INFO_CRC0																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_INFO_CRC0_INFO_CRC0_0																		(0x1u<<0)

// INFO_CRC1 Configuration

#define	OTP_DATA_RAW_INFO_CRC1_INFO_CRC1																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_INFO_CRC1_INFO_CRC1_0																		(0x1u<<0)

// CRIT0 Configuration

#define	OTP_DATA_RAW_CRIT0_ARM_DISABLE																			(0x1u<<0)
#define	OTP_DATA_RAW_CRIT0_RISCV_DISABLE																		(0x1u<<1)

// CRIT0_R1 Configuration

#define	OTP_DATA_RAW_CRIT0_R1_CRIT0_R1																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R1_CRIT0_R1_0																		(0x1u<<0)

// CRIT0_R2 Configuration

#define	OTP_DATA_RAW_CRIT0_R2_CRIT0_R2																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R2_CRIT0_R2_0																		(0x1u<<0)

// CRIT0_R3 Configuration

#define	OTP_DATA_RAW_CRIT0_R3_CRIT0_R3																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R3_CRIT0_R3_0																		(0x1u<<0)

// CRIT0_R4 Configuration

#define	OTP_DATA_RAW_CRIT0_R4_CRIT0_R4																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R4_CRIT0_R4_0																		(0x1u<<0)

// CRIT0_R5 Configuration

#define	OTP_DATA_RAW_CRIT0_R5_CRIT0_R5																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R5_CRIT0_R5_0																		(0x1u<<0)

// CRIT0_R6 Configuration

#define	OTP_DATA_RAW_CRIT0_R6_CRIT0_R6																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R6_CRIT0_R6_0																		(0x1u<<0)

// CRIT0_R7 Configuration

#define	OTP_DATA_RAW_CRIT0_R7_CRIT0_R7																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT0_R7_CRIT0_R7_0																		(0x1u<<0)

// CRIT1 Configuration

#define	OTP_DATA_RAW_CRIT1_SECURE_BOOT_ENABLE																	(0x1u<<0)
#define	OTP_DATA_RAW_CRIT1_SECURE_DEBUG_DISABLE																	(0x1u<<1)
#define	OTP_DATA_RAW_CRIT1_DEBUG_DISABLE																		(0x1u<<2)
#define	OTP_DATA_RAW_CRIT1_BOOT_ARCH																			(0x1u<<3)
#define	OTP_DATA_RAW_CRIT1_GLITCH_DETECTOR_ENABLE																(0x1u<<4)
#define	OTP_DATA_RAW_CRIT1_GLITCH_DETECTOR_SENS																	(0x3u<<5)
#define	OTP_DATA_RAW_CRIT1_GLITCH_DETECTOR_SENS_0																(0x1u<<5)

// CRIT1_R1 Configuration

#define	OTP_DATA_RAW_CRIT1_R1_CRIT1_R1																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R1_CRIT1_R1_0																		(0x1u<<0)

// CRIT1_R2 Configuration

#define	OTP_DATA_RAW_CRIT1_R2_CRIT1_R2																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R2_CRIT1_R2_0																		(0x1u<<0)

// CRIT1_R3 Configuration

#define	OTP_DATA_RAW_CRIT1_R3_CRIT1_R3																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R3_CRIT1_R3_0																		(0x1u<<0)

// CRIT1_R4 Configuration

#define	OTP_DATA_RAW_CRIT1_R4_CRIT1_R4																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R4_CRIT1_R4_0																		(0x1u<<0)

// CRIT1_R5 Configuration

#define	OTP_DATA_RAW_CRIT1_R5_CRIT1_R5																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R5_CRIT1_R5_0																		(0x1u<<0)

// CRIT1_R6 Configuration

#define	OTP_DATA_RAW_CRIT1_R6_CRIT1_R6																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R6_CRIT1_R6_0																		(0x1u<<0)

// CRIT1_R7 Configuration

#define	OTP_DATA_RAW_CRIT1_R7_CRIT1_R7																			(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_CRIT1_R7_CRIT1_R7_0																		(0x1u<<0)

// BOOT_FLAGS0 Configuration

#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_BOOTSEL_EXEC2															(0x1u<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS0_ENABLE_BOOTSEL_LED																(0x1u<<1)
#define	OTP_DATA_RAW_BOOT_FLAGS0_ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG										(0x1u<<2)
#define	OTP_DATA_RAW_BOOT_FLAGS0_FLASH_IO_VOLTAGE_1V8															(0x1u<<3)
#define	OTP_DATA_RAW_BOOT_FLAGS0_FAST_SIGCHECK_ROSC_DIV															(0x1u<<4)
#define	OTP_DATA_RAW_BOOT_FLAGS0_FLASH_DEVINFO_ENABLE															(0x1u<<5)
#define	OTP_DATA_RAW_BOOT_FLAGS0_OVERRIDE_FLASH_PARTITION_SLOT_SIZE												(0x1u<<6)
#define	OTP_DATA_RAW_BOOT_FLAGS0_SINGLE_FLASH_BINARY															(0x1u<<7)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_AUTO_SWITCH_ARCH														(0x1u<<8)
#define	OTP_DATA_RAW_BOOT_FLAGS0_SECURE_PARTITION_TABLE															(0x1u<<9)
#define	OTP_DATA_RAW_BOOT_FLAGS0_HASHED_PARTITION_TABLE															(0x1u<<10)
#define	OTP_DATA_RAW_BOOT_FLAGS0_ROLLBACK_REQUIRED																(0x1u<<11)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_FLASH_BOOT																(0x1u<<12)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_OTP_BOOT																(0x1u<<13)
#define	OTP_DATA_RAW_BOOT_FLAGS0_ENABLE_OTP_BOOT																(0x1u<<14)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_POWER_SCRATCH															(0x1u<<15)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_WATCHDOG_SCRATCH														(0x1u<<16)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_BOOTSEL_USB_MSD_IFC													(0x1u<<17)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_BOOTSEL_USB_PICOBOOT_IFC												(0x1u<<18)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_BOOTSEL_UART_BOOT														(0x1u<<19)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_XIP_ACCESS_ON_SRAM_ENTRY												(0x1u<<20)
#define	OTP_DATA_RAW_BOOT_FLAGS0_DISABLE_SRAM_WINDOW_BOOT														(0x1u<<21)

// BOOT_FLAGS0_R1 Configuration

