Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
#define	OTP_DATA_RAW_BOOT_FLAGS0_R1_BOOT_FLAGS0_R1																(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS0_R1_BOOT_FLAGS0_R1_0															(0x1u<<0)

// BOOT_FLAGS0_R2 Configuration

#define	OTP_DATA_RAW_BOOT_FLAGS0_R2_BOOT_FLAGS0_R2																(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS0_R2_BOOT_FLAGS0_R2_0															(0x1u<<0)

// BOOT_FLAGS1 Configuration

#define	OTP_DATA_RAW_BOOT_FLAGS1_KEY_VALID																		(0xFu<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS1_KEY_VALID_0																	(0x1u<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS1_KEY_INVALID																	(0xFu<<8)
#define	OTP_DATA_RAW_BOOT_FLAGS1_KEY_INVALID_0																	(0x1u<<8)
#define	OTP_DATA_RAW_BOOT_FLAGS1_DOUBLE_TAP_DELAY																(0x7u<<16)
#define	OTP_DATA_RAW_BOOT_FLAGS1_DOUBLE_TAP_DELAY_0																(0x1u<<16)
#define	OTP_DATA_RAW_BOOT_FLAGS1_DOUBLE_TAP																		(0x1u<<19)

// BOOT_FLAGS1_R1 Configuration

#define	OTP_DATA_RAW_BOOT_FLAGS1_R1_BOOT_FLAGS1_R1																(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS1_R1_BOOT_FLAGS1_R1_0															(0x1u<<0)

// BOOT_FLAGS1_R2 Configuration

#define	OTP_DATA_RAW_BOOT_FLAGS1_R2_BOOT_FLAGS1_R2																(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_BOOT_FLAGS1_R2_BOOT_FLAGS1_R2_0															(0x1u<<0)

// DEFAULT_BOOT_VERSION0 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_DEFAULT_BOOT_VERSION0												(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_DEFAULT_BOOT_VERSION0_0												(0x1u<<0)

// DEFAULT_BOOT_VERSION0_R1 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_R1_DEFAULT_BOOT_VERSION0_R1											(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_R1_DEFAULT_BOOT_VERSION0_R1_0										(0x1u<<0)

// DEFAULT_BOOT_VERSION0_R2 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_R2_DEFAULT_BOOT_VERSION0_R2											(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION0_R2_DEFAULT_BOOT_VERSION0_R2_0										(0x1u<<0)

// DEFAULT_BOOT_VERSION1 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_DEFAULT_BOOT_VERSION1												(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_DEFAULT_BOOT_VERSION1_0												(0x1u<<0)

// DEFAULT_BOOT_VERSION1_R1 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_R1_DEFAULT_BOOT_VERSION1_R1											(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_R1_DEFAULT_BOOT_VERSION1_R1_0										(0x1u<<0)

// DEFAULT_BOOT_VERSION1_R2 Configuration

#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_R2_DEFAULT_BOOT_VERSION1_R2											(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_DEFAULT_BOOT_VERSION1_R2_DEFAULT_BOOT_VERSION1_R2_0										(0x1u<<0)

// FLASH_DEVINFO Configuration

#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_GPIO																		(0x3Fu<<0)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_GPIO_0																	(0x1u<<0)
#define	OTP_DATA_RAW_FLASH_DEVINFO_D8H_ERASE_SUPPORTED															(0x1u<<7)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE																		(0xFu<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_0																	(0x1u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE																		(0xFu<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_0																	(0x1u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_NONE																(0x0u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_8K																	(0x1u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_16K																	(0x2u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_32K																	(0x3u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_64K																	(0x4u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_128K																(0x5u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_256K																(0x6u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_512K																(0x7u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_1M																	(0x8u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_2M																	(0x9u<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_4M																	(0xAu<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_8M																	(0xBu<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS0_SIZE_16M																	(0xCu<<8)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_NONE																(0x0u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_8K																	(0x1u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_16K																	(0x2u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_32K																	(0x3u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_64K																	(0x4u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_128K																(0x5u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_256K																(0x6u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_512K																(0x7u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_1M																	(0x8u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_2M																	(0x9u<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_4M																	(0xAu<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_8M																	(0xBu<<12)
#define	OTP_DATA_RAW_FLASH_DEVINFO_CS1_SIZE_16M																	(0xCu<<12)

// FLASH_PARTITION_SLOT_SIZE Configuration

#define	OTP_DATA_RAW_FLASH_PARTITION_SLOT_SIZE_FLASH_PARTITION_SLOT_SIZE										(0xFFFFu<<0)
#define	OTP_DATA_RAW_FLASH_PARTITION_SLOT_SIZE_FLASH_PARTITION_SLOT_SIZE_0										(0x1u<<0)

// BOOTSEL_LED_CFG Configuration

#define	OTP_DATA_RAW_BOOTSEL_LED_CFG_PIN																		(0x3Fu<<0)
#define	OTP_DATA_RAW_BOOTSEL_LED_CFG_PIN_0																		(0x1u<<0)
#define	OTP_DATA_RAW_BOOTSEL_LED_CFG_ACTIVELOW																	(0x1u<<8)

// BOOTSEL_PLL_CFG Configuration

#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_FBDIV																		(0x1FFu<<0)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_FBDIV_0																	(0x1u<<0)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_POSTDIV1																	(0x7u<<9)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_POSTDIV1_0																	(0x1u<<9)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_POSTDIV2																	(0x7u<<12)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_POSTDIV2_0																	(0x1u<<12)
#define	OTP_DATA_RAW_BOOTSEL_PLL_CFG_REFDIV																		(0x1u<<15)

// BOOTSEL_XOSC_CFG Configuration

#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_STARTUP																	(0x3FFFu<<0)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_STARTUP_0																	(0x1u<<0)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE																		(0x3u<<14)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE_0																	(0x1u<<14)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE_1_15MHZ																(0x0u<<14)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE_10_30MHZ															(0x1u<<14)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE_25_60MHZ															(0x2u<<14)
#define	OTP_DATA_RAW_BOOTSEL_XOSC_CFG_RANGE_40_100MHZ															(0x3u<<14)

// USB_BOOT_FLAGS Configuration

#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_VID_VALUE_VALID												(0x1u<<0)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_PID_VALUE_VALID												(0x1u<<1)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_SERIAL_NUMBER_VALUE_VALID										(0x1u<<2)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_LANG_ID_VALUE_VALID											(0x1u<<3)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_MANUFACTURER_STRDEF_VALID										(0x1u<<4)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_PRODUCT_STRDEF_VALID											(0x1u<<5)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_DEVICE_SERIAL_NUMBER_STRDEF_VALID									(0x1u<<6)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES_VALID								(0x1u<<7)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_VOLUME_LABEL_STRDEF_VALID												(0x1u<<8)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_SCSI_INQUIRY_VENDOR_STRDEF_VALID											(0x1u<<9)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_SCSI_INQUIRY_PRODUCT_STRDEF_VALID										(0x1u<<10)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_SCSI_INQUIRY_VERSION_STRDEF_VALID										(0x1u<<11)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_INDEX_HTM_REDIRECT_URL_STRDEF_VALID										(0x1u<<12)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_INDEX_HTM_REDIRECT_NAME_STRDEF_VALID										(0x1u<<13)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_INFO_UF2_TXT_MODEL_STRDEF_VALID											(0x1u<<14)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WL_INFO_UF2_TXT_BOARD_ID_STRDEF_VALID										(0x1u<<15)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_WHITE_LABEL_ADDR_VALID														(0x1u<<22)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_DP_DM_SWAP																	(0x1u<<23)

// USB_BOOT_FLAGS_R1 Configuration

