Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_R1_USB_BOOT_FLAGS_R1														(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_R1_USB_BOOT_FLAGS_R1_0														(0x1u<<0)

// USB_BOOT_FLAGS_R2 Configuration

#define	OTP_DATA_RAW_USB_BOOT_FLAGS_R2_USB_BOOT_FLAGS_R2														(0xFFFFFFu<<0)
#define	OTP_DATA_RAW_USB_BOOT_FLAGS_R2_USB_BOOT_FLAGS_R2_0														(0x1u<<0)

// USB_WHITE_LABEL_ADDR Configuration

#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR													(0xFFFFu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_0												(0x1u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_VID_VALUE						(0x0u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_PID_VALUE						(0x1u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_BCD_DEVICE_VALUE				(0x2u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_LANG_ID_VALUE					(0x3u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_MANUFACTURER_STRDEF				(0x4u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_PRODUCT_STRDEF					(0x5u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_DEVICE_SERIAL_NUMBER_STRDEF			(0x6u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES		(0x7u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_VOLUME_LABEL_STRDEF						(0x8u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_VENDOR_STRDEF					(0x9u<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_PRODUCT_STRDEF				(0xAu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_SCSI_INQUIRY_VERSION_STRDEF				(0xBu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INDEX_HTM_REDIRECT_URL_STRDEF				(0xCu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INDEX_HTM_REDIRECT_NAME_STRDEF				(0xDu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INFO_UF2_TXT_MODEL_STRDEF					(0xEu<<0)
#define	OTP_DATA_RAW_USB_WHITE_LABEL_ADDR_USB_WHITE_LABEL_ADDR_INDEX_INFO_UF2_TXT_BOARD_ID_STRDEF				(0xFu<<0)

// OTPBOOT_SRC Configuration

#define	OTP_DATA_RAW_OTPBOOT_SRC_OTPBOOT_SRC																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_OTPBOOT_SRC_OTPBOOT_SRC_0																	(0x1u<<0)

// OTPBOOT_LEN Configuration

#define	OTP_DATA_RAW_OTPBOOT_LEN_OTPBOOT_LEN																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_OTPBOOT_LEN_OTPBOOT_LEN_0																	(0x1u<<0)

// OTPBOOT_DST0 Configuration

#define	OTP_DATA_RAW_OTPBOOT_DST0_OTPBOOT_DST0																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_OTPBOOT_DST0_OTPBOOT_DST0_0																(0x1u<<0)

// OTPBOOT_DST1 Configuration

#define	OTP_DATA_RAW_OTPBOOT_DST1_OTPBOOT_DST1																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_OTPBOOT_DST1_OTPBOOT_DST1_0																(0x1u<<0)

// BOOTKEY0_0 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_0_BOOTKEY0_0																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_0_BOOTKEY0_0_0																	(0x1u<<0)

// BOOTKEY0_1 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_1_BOOTKEY0_1																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_1_BOOTKEY0_1_0																	(0x1u<<0)

// BOOTKEY0_2 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_2_BOOTKEY0_2																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_2_BOOTKEY0_2_0																	(0x1u<<0)

// BOOTKEY0_3 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_3_BOOTKEY0_3																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_3_BOOTKEY0_3_0																	(0x1u<<0)

// BOOTKEY0_4 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_4_BOOTKEY0_4																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_4_BOOTKEY0_4_0																	(0x1u<<0)

// BOOTKEY0_5 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_5_BOOTKEY0_5																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_5_BOOTKEY0_5_0																	(0x1u<<0)

// BOOTKEY0_6 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_6_BOOTKEY0_6																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_6_BOOTKEY0_6_0																	(0x1u<<0)

// BOOTKEY0_7 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_7_BOOTKEY0_7																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_7_BOOTKEY0_7_0																	(0x1u<<0)

// BOOTKEY0_8 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_8_BOOTKEY0_8																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_8_BOOTKEY0_8_0																	(0x1u<<0)

// BOOTKEY0_9 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_9_BOOTKEY0_9																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_9_BOOTKEY0_9_0																	(0x1u<<0)

// BOOTKEY0_10 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_10_BOOTKEY0_10																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_10_BOOTKEY0_10_0																	(0x1u<<0)

// BOOTKEY0_11 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_11_BOOTKEY0_11																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_11_BOOTKEY0_11_0																	(0x1u<<0)

// BOOTKEY0_12 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_12_BOOTKEY0_12																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_12_BOOTKEY0_12_0																	(0x1u<<0)

// BOOTKEY0_13 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_13_BOOTKEY0_13																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_13_BOOTKEY0_13_0																	(0x1u<<0)

// BOOTKEY0_14 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_14_BOOTKEY0_14																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_14_BOOTKEY0_14_0																	(0x1u<<0)

// BOOTKEY0_15 Configuration

#define	OTP_DATA_RAW_BOOTKEY0_15_BOOTKEY0_15																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY0_15_BOOTKEY0_15_0																	(0x1u<<0)

// BOOTKEY1_0 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_0_BOOTKEY1_0																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_0_BOOTKEY1_0_0																	(0x1u<<0)

// BOOTKEY1_1 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_1_BOOTKEY1_1																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_1_BOOTKEY1_1_0																	(0x1u<<0)

// BOOTKEY1_2 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_2_BOOTKEY1_2																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_2_BOOTKEY1_2_0																	(0x1u<<0)

// BOOTKEY1_3 Configuration

