Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
#define	OTP_DATA_RAW_BOOTKEY1_3_BOOTKEY1_3																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_3_BOOTKEY1_3_0																	(0x1u<<0)

// BOOTKEY1_4 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_4_BOOTKEY1_4																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_4_BOOTKEY1_4_0																	(0x1u<<0)

// BOOTKEY1_5 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_5_BOOTKEY1_5																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_5_BOOTKEY1_5_0																	(0x1u<<0)

// BOOTKEY1_6 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_6_BOOTKEY1_6																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_6_BOOTKEY1_6_0																	(0x1u<<0)

// BOOTKEY1_7 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_7_BOOTKEY1_7																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_7_BOOTKEY1_7_0																	(0x1u<<0)

// BOOTKEY1_8 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_8_BOOTKEY1_8																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_8_BOOTKEY1_8_0																	(0x1u<<0)

// BOOTKEY1_9 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_9_BOOTKEY1_9																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_9_BOOTKEY1_9_0																	(0x1u<<0)

// BOOTKEY1_10 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_10_BOOTKEY1_10																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_10_BOOTKEY1_10_0																	(0x1u<<0)

// BOOTKEY1_11 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_11_BOOTKEY1_11																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_11_BOOTKEY1_11_0																	(0x1u<<0)

// BOOTKEY1_12 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_12_BOOTKEY1_12																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_12_BOOTKEY1_12_0																	(0x1u<<0)

// BOOTKEY1_13 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_13_BOOTKEY1_13																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_13_BOOTKEY1_13_0																	(0x1u<<0)

// BOOTKEY1_14 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_14_BOOTKEY1_14																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_14_BOOTKEY1_14_0																	(0x1u<<0)

// BOOTKEY1_15 Configuration

#define	OTP_DATA_RAW_BOOTKEY1_15_BOOTKEY1_15																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY1_15_BOOTKEY1_15_0																	(0x1u<<0)

// BOOTKEY2_0 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_0_BOOTKEY2_0																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_0_BOOTKEY2_0_0																	(0x1u<<0)

// BOOTKEY2_1 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_1_BOOTKEY2_1																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_1_BOOTKEY2_1_0																	(0x1u<<0)

// BOOTKEY2_2 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_2_BOOTKEY2_2																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_2_BOOTKEY2_2_0																	(0x1u<<0)

// BOOTKEY2_3 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_3_BOOTKEY2_3																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_3_BOOTKEY2_3_0																	(0x1u<<0)

// BOOTKEY2_4 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_4_BOOTKEY2_4																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_4_BOOTKEY2_4_0																	(0x1u<<0)

// BOOTKEY2_5 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_5_BOOTKEY2_5																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_5_BOOTKEY2_5_0																	(0x1u<<0)

// BOOTKEY2_6 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_6_BOOTKEY2_6																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_6_BOOTKEY2_6_0																	(0x1u<<0)

// BOOTKEY2_7 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_7_BOOTKEY2_7																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_7_BOOTKEY2_7_0																	(0x1u<<0)

// BOOTKEY2_8 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_8_BOOTKEY2_8																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_8_BOOTKEY2_8_0																	(0x1u<<0)

// BOOTKEY2_9 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_9_BOOTKEY2_9																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_9_BOOTKEY2_9_0																	(0x1u<<0)

// BOOTKEY2_10 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_10_BOOTKEY2_10																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_10_BOOTKEY2_10_0																	(0x1u<<0)

// BOOTKEY2_11 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_11_BOOTKEY2_11																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_11_BOOTKEY2_11_0																	(0x1u<<0)

// BOOTKEY2_12 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_12_BOOTKEY2_12																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_12_BOOTKEY2_12_0																	(0x1u<<0)

// BOOTKEY2_13 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_13_BOOTKEY2_13																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_13_BOOTKEY2_13_0																	(0x1u<<0)

// BOOTKEY2_14 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_14_BOOTKEY2_14																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_14_BOOTKEY2_14_0																	(0x1u<<0)

// BOOTKEY2_15 Configuration

#define	OTP_DATA_RAW_BOOTKEY2_15_BOOTKEY2_15																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY2_15_BOOTKEY2_15_0																	(0x1u<<0)

// BOOTKEY3_0 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_0_BOOTKEY3_0																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_0_BOOTKEY3_0_0																	(0x1u<<0)

// BOOTKEY3_1 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_1_BOOTKEY3_1																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_1_BOOTKEY3_1_0																	(0x1u<<0)

// BOOTKEY3_2 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_2_BOOTKEY3_2																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_2_BOOTKEY3_2_0																	(0x1u<<0)

// BOOTKEY3_3 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_3_BOOTKEY3_3																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_3_BOOTKEY3_3_0																	(0x1u<<0)

// BOOTKEY3_4 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_4_BOOTKEY3_4																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_4_BOOTKEY3_4_0																	(0x1u<<0)

// BOOTKEY3_5 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_5_BOOTKEY3_5																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_5_BOOTKEY3_5_0																	(0x1u<<0)

// BOOTKEY3_6 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_6_BOOTKEY3_6																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_6_BOOTKEY3_6_0																	(0x1u<<0)

// BOOTKEY3_7 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_7_BOOTKEY3_7																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_7_BOOTKEY3_7_0																	(0x1u<<0)

// BOOTKEY3_8 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_8_BOOTKEY3_8																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_8_BOOTKEY3_8_0																	(0x1u<<0)

// BOOTKEY3_9 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_9_BOOTKEY3_9																		(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_9_BOOTKEY3_9_0																	(0x1u<<0)

