Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
// BOOTKEY3_10 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_10_BOOTKEY3_10																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_10_BOOTKEY3_10_0																	(0x1u<<0)

// BOOTKEY3_11 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_11_BOOTKEY3_11																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_11_BOOTKEY3_11_0																	(0x1u<<0)

// BOOTKEY3_12 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_12_BOOTKEY3_12																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_12_BOOTKEY3_12_0																	(0x1u<<0)

// BOOTKEY3_13 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_13_BOOTKEY3_13																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_13_BOOTKEY3_13_0																	(0x1u<<0)

// BOOTKEY3_14 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_14_BOOTKEY3_14																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_14_BOOTKEY3_14_0																	(0x1u<<0)

// BOOTKEY3_15 Configuration

#define	OTP_DATA_RAW_BOOTKEY3_15_BOOTKEY3_15																	(0xFFFFu<<0)
#define	OTP_DATA_RAW_BOOTKEY3_15_BOOTKEY3_15_0																	(0x1u<<0)

// KEY1_0 Configuration

#define	OTP_DATA_RAW_KEY1_0_KEY1_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_0_KEY1_0_0																			(0x1u<<0)

// KEY1_1 Configuration

#define	OTP_DATA_RAW_KEY1_1_KEY1_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_1_KEY1_1_0																			(0x1u<<0)

// KEY1_2 Configuration

#define	OTP_DATA_RAW_KEY1_2_KEY1_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_2_KEY1_2_0																			(0x1u<<0)

// KEY1_3 Configuration

#define	OTP_DATA_RAW_KEY1_3_KEY1_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_3_KEY1_3_0																			(0x1u<<0)

// KEY1_4 Configuration

#define	OTP_DATA_RAW_KEY1_4_KEY1_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_4_KEY1_4_0																			(0x1u<<0)

// KEY1_5 Configuration

#define	OTP_DATA_RAW_KEY1_5_KEY1_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_5_KEY1_5_0																			(0x1u<<0)

// KEY1_6 Configuration

#define	OTP_DATA_RAW_KEY1_6_KEY1_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_6_KEY1_6_0																			(0x1u<<0)

// KEY1_7 Configuration

#define	OTP_DATA_RAW_KEY1_7_KEY1_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY1_7_KEY1_7_0																			(0x1u<<0)

// KEY2_0 Configuration

#define	OTP_DATA_RAW_KEY2_0_KEY2_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_0_KEY2_0_0																			(0x1u<<0)

// KEY2_1 Configuration

#define	OTP_DATA_RAW_KEY2_1_KEY2_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_1_KEY2_1_0																			(0x1u<<0)

// KEY2_2 Configuration

#define	OTP_DATA_RAW_KEY2_2_KEY2_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_2_KEY2_2_0																			(0x1u<<0)

// KEY2_3 Configuration

#define	OTP_DATA_RAW_KEY2_3_KEY2_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_3_KEY2_3_0																			(0x1u<<0)

// KEY2_4 Configuration

#define	OTP_DATA_RAW_KEY2_4_KEY2_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_4_KEY2_4_0																			(0x1u<<0)

// KEY2_5 Configuration

#define	OTP_DATA_RAW_KEY2_5_KEY2_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_5_KEY2_5_0																			(0x1u<<0)

// KEY2_6 Configuration

#define	OTP_DATA_RAW_KEY2_6_KEY2_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_6_KEY2_6_0																			(0x1u<<0)

// KEY2_7 Configuration

#define	OTP_DATA_RAW_KEY2_7_KEY2_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY2_7_KEY2_7_0																			(0x1u<<0)

// KEY3_0 Configuration

#define	OTP_DATA_RAW_KEY3_0_KEY3_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_0_KEY3_0_0																			(0x1u<<0)

// KEY3_1 Configuration

#define	OTP_DATA_RAW_KEY3_1_KEY3_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_1_KEY3_1_0																			(0x1u<<0)

// KEY3_2 Configuration

#define	OTP_DATA_RAW_KEY3_2_KEY3_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_2_KEY3_2_0																			(0x1u<<0)

// KEY3_3 Configuration

#define	OTP_DATA_RAW_KEY3_3_KEY3_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_3_KEY3_3_0																			(0x1u<<0)

// KEY3_4 Configuration

#define	OTP_DATA_RAW_KEY3_4_KEY3_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_4_KEY3_4_0																			(0x1u<<0)

// KEY3_5 Configuration

#define	OTP_DATA_RAW_KEY3_5_KEY3_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_5_KEY3_5_0																			(0x1u<<0)

// KEY3_6 Configuration

#define	OTP_DATA_RAW_KEY3_6_KEY3_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_6_KEY3_6_0																			(0x1u<<0)

// KEY3_7 Configuration

#define	OTP_DATA_RAW_KEY3_7_KEY3_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY3_7_KEY3_7_0																			(0x1u<<0)

// KEY4_0 Configuration

#define	OTP_DATA_RAW_KEY4_0_KEY4_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_0_KEY4_0_0																			(0x1u<<0)

// KEY4_1 Configuration

#define	OTP_DATA_RAW_KEY4_1_KEY4_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_1_KEY4_1_0																			(0x1u<<0)

// KEY4_2 Configuration

#define	OTP_DATA_RAW_KEY4_2_KEY4_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_2_KEY4_2_0																			(0x1u<<0)

// KEY4_3 Configuration

#define	OTP_DATA_RAW_KEY4_3_KEY4_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_3_KEY4_3_0																			(0x1u<<0)

// KEY4_4 Configuration

#define	OTP_DATA_RAW_KEY4_4_KEY4_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_4_KEY4_4_0																			(0x1u<<0)

// KEY4_5 Configuration

#define	OTP_DATA_RAW_KEY4_5_KEY4_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_5_KEY4_5_0																			(0x1u<<0)

// KEY4_6 Configuration

#define	OTP_DATA_RAW_KEY4_6_KEY4_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_6_KEY4_6_0																			(0x1u<<0)

// KEY4_7 Configuration

#define	OTP_DATA_RAW_KEY4_7_KEY4_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY4_7_KEY4_7_0																			(0x1u<<0)

// KEY5_0 Configuration

#define	OTP_DATA_RAW_KEY5_0_KEY5_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_0_KEY5_0_0																			(0x1u<<0)

// KEY5_1 Configuration

#define	OTP_DATA_RAW_KEY5_1_KEY5_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_1_KEY5_1_0																			(0x1u<<0)

// KEY5_2 Configuration

#define	OTP_DATA_RAW_KEY5_2_KEY5_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_2_KEY5_2_0																			(0x1u<<0)

// KEY5_3 Configuration

#define	OTP_DATA_RAW_KEY5_3_KEY5_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_3_KEY5_3_0																			(0x1u<<0)

// KEY5_4 Configuration

#define	OTP_DATA_RAW_KEY5_4_KEY5_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_4_KEY5_4_0																			(0x1u<<0)

// KEY5_5 Configuration

#define	OTP_DATA_RAW_KEY5_5_KEY5_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_5_KEY5_5_0																			(0x1u<<0)

