Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
// KEY5_6 Configuration

#define	OTP_DATA_RAW_KEY5_6_KEY5_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_6_KEY5_6_0																			(0x1u<<0)

// KEY5_7 Configuration

#define	OTP_DATA_RAW_KEY5_7_KEY5_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY5_7_KEY5_7_0																			(0x1u<<0)

// KEY6_0 Configuration

#define	OTP_DATA_RAW_KEY6_0_KEY6_0																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_0_KEY6_0_0																			(0x1u<<0)

// KEY6_1 Configuration

#define	OTP_DATA_RAW_KEY6_1_KEY6_1																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_1_KEY6_1_0																			(0x1u<<0)

// KEY6_2 Configuration

#define	OTP_DATA_RAW_KEY6_2_KEY6_2																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_2_KEY6_2_0																			(0x1u<<0)

// KEY6_3 Configuration

#define	OTP_DATA_RAW_KEY6_3_KEY6_3																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_3_KEY6_3_0																			(0x1u<<0)

// KEY6_4 Configuration

#define	OTP_DATA_RAW_KEY6_4_KEY6_4																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_4_KEY6_4_0																			(0x1u<<0)

// KEY6_5 Configuration

#define	OTP_DATA_RAW_KEY6_5_KEY6_5																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_5_KEY6_5_0																			(0x1u<<0)

// KEY6_6 Configuration

#define	OTP_DATA_RAW_KEY6_6_KEY6_6																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_6_KEY6_6_0																			(0x1u<<0)

// KEY6_7 Configuration

#define	OTP_DATA_RAW_KEY6_7_KEY6_7																				(0xFFFFu<<0)
#define	OTP_DATA_RAW_KEY6_7_KEY6_7_0																			(0x1u<<0)

// KEY1_VALID Configuration

#define	OTP_DATA_RAW_KEY1_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY1_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY1_VALID_VALID_R2																		(0x1u<<16)

// KEY2_VALID Configuration

#define	OTP_DATA_RAW_KEY2_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY2_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY2_VALID_VALID_R2																		(0x1u<<16)

// KEY3_VALID Configuration

#define	OTP_DATA_RAW_KEY3_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY3_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY3_VALID_VALID_R2																		(0x1u<<16)

// KEY4_VALID Configuration

#define	OTP_DATA_RAW_KEY4_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY4_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY4_VALID_VALID_R2																		(0x1u<<16)

// KEY5_VALID Configuration

#define	OTP_DATA_RAW_KEY5_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY5_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY5_VALID_VALID_R2																		(0x1u<<16)

// KEY6_VALID Configuration

#define	OTP_DATA_RAW_KEY6_VALID_VALID																			(0x1u<<0)
#define	OTP_DATA_RAW_KEY6_VALID_VALID_R1																		(0x1u<<8)
#define	OTP_DATA_RAW_KEY6_VALID_VALID_R2																		(0x1u<<16)

// PAGE0_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE0_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE0_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE0_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE0_LOCK0_R1																				(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE0_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE0_LOCK0_R2																				(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE0_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE0_LOCK0_NO_KEY_STATE_READ_ONLY															(0x0u<<6)
#define	OTP_DATA_RAW_PAGE0_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE0_LOCK1 Configuration

#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S																			(0x3u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS																		(0x3u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS_0																		(0x1u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL																		(0x3u<<4)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL_0																		(0x1u<<4)
#define	OTP_DATA_RAW_PAGE0_LOCK1_R1																				(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE0_LOCK1_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE0_LOCK1_R2																				(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE0_LOCK1_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S_READ_WRITE																(0x0u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S_READ_ONLY																(0x1u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S_RESERVED																(0x2u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_S_INACCESSIBLE															(0x3u<<0)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS_READ_WRITE																(0x0u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS_READ_ONLY																(0x1u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS_RESERVED																(0x2u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_NS_INACCESSIBLE															(0x3u<<2)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL_READ_WRITE																(0x0u<<4)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL_READ_ONLY																(0x1u<<4)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL_RESERVED																(0x2u<<4)
#define	OTP_DATA_RAW_PAGE0_LOCK1_LOCK_BL_INACCESSIBLE															(0x3u<<4)

// PAGE1_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE1_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE1_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE1_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE1_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE1_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE1_LOCK0_R1																				(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE1_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE1_LOCK0_R2																				(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE1_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE1_LOCK0_NO_KEY_STATE_READ_ONLY															(0x0u<<6)
#define	OTP_DATA_RAW_PAGE1_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

