Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_otp_data_raw.h
#define	OTP_DATA_RAW_PAGE17_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE17_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE17_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE17_LOCK0_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE17_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE17_LOCK0_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE17_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE17_LOCK0_NO_KEY_STATE_READ_ONLY														(0x0u<<6)
#define	OTP_DATA_RAW_PAGE17_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE17_LOCK1 Configuration

#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S																		(0x3u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS																		(0x3u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS_0																		(0x1u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL																		(0x3u<<4)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL_0																		(0x1u<<4)
#define	OTP_DATA_RAW_PAGE17_LOCK1_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE17_LOCK1_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE17_LOCK1_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE17_LOCK1_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S_READ_WRITE																(0x0u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S_READ_ONLY																(0x1u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S_RESERVED																(0x2u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_S_INACCESSIBLE															(0x3u<<0)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS_READ_WRITE															(0x0u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS_READ_ONLY																(0x1u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS_RESERVED																(0x2u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_NS_INACCESSIBLE															(0x3u<<2)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL_READ_WRITE															(0x0u<<4)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL_READ_ONLY																(0x1u<<4)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL_RESERVED																(0x2u<<4)
#define	OTP_DATA_RAW_PAGE17_LOCK1_LOCK_BL_INACCESSIBLE															(0x3u<<4)

// PAGE18_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE18_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE18_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE18_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE18_LOCK0_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE18_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE18_LOCK0_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE18_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE18_LOCK0_NO_KEY_STATE_READ_ONLY														(0x0u<<6)
#define	OTP_DATA_RAW_PAGE18_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE18_LOCK1 Configuration

#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S																		(0x3u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS																		(0x3u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS_0																		(0x1u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL																		(0x3u<<4)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL_0																		(0x1u<<4)
#define	OTP_DATA_RAW_PAGE18_LOCK1_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE18_LOCK1_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE18_LOCK1_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE18_LOCK1_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S_READ_WRITE																(0x0u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S_READ_ONLY																(0x1u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S_RESERVED																(0x2u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_S_INACCESSIBLE															(0x3u<<0)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS_READ_WRITE															(0x0u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS_READ_ONLY																(0x1u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS_RESERVED																(0x2u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_NS_INACCESSIBLE															(0x3u<<2)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL_READ_WRITE															(0x0u<<4)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL_READ_ONLY																(0x1u<<4)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL_RESERVED																(0x2u<<4)
#define	OTP_DATA_RAW_PAGE18_LOCK1_LOCK_BL_INACCESSIBLE															(0x3u<<4)

// PAGE19_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE19_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE19_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE19_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE19_LOCK0_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE19_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE19_LOCK0_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE19_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE19_LOCK0_NO_KEY_STATE_READ_ONLY														(0x0u<<6)
#define	OTP_DATA_RAW_PAGE19_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE19_LOCK1 Configuration

#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S																		(0x3u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS																		(0x3u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS_0																		(0x1u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL																		(0x3u<<4)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL_0																		(0x1u<<4)
#define	OTP_DATA_RAW_PAGE19_LOCK1_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE19_LOCK1_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE19_LOCK1_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE19_LOCK1_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S_READ_WRITE																(0x0u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S_READ_ONLY																(0x1u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S_RESERVED																(0x2u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_S_INACCESSIBLE															(0x3u<<0)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS_READ_WRITE															(0x0u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS_READ_ONLY																(0x1u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS_RESERVED																(0x2u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_NS_INACCESSIBLE															(0x3u<<2)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL_READ_WRITE															(0x0u<<4)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL_READ_ONLY																(0x1u<<4)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL_RESERVED																(0x2u<<4)
#define	OTP_DATA_RAW_PAGE19_LOCK1_LOCK_BL_INACCESSIBLE															(0x3u<<4)

// PAGE20_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE20_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE20_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE20_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE20_LOCK0_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE20_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE20_LOCK0_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE20_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE20_LOCK0_NO_KEY_STATE_READ_ONLY														(0x0u<<6)
#define	OTP_DATA_RAW_PAGE20_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE20_LOCK1 Configuration

#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S																		(0x3u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS																		(0x3u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS_0																		(0x1u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL																		(0x3u<<4)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL_0																		(0x1u<<4)
#define	OTP_DATA_RAW_PAGE20_LOCK1_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE20_LOCK1_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE20_LOCK1_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE20_LOCK1_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S_READ_WRITE																(0x0u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S_READ_ONLY																(0x1u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S_RESERVED																(0x2u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_S_INACCESSIBLE															(0x3u<<0)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS_READ_WRITE															(0x0u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS_READ_ONLY																(0x1u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS_RESERVED																(0x2u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_NS_INACCESSIBLE															(0x3u<<2)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL_READ_WRITE															(0x0u<<4)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL_READ_ONLY																(0x1u<<4)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL_RESERVED																(0x2u<<4)
#define	OTP_DATA_RAW_PAGE20_LOCK1_LOCK_BL_INACCESSIBLE															(0x3u<<4)

// PAGE21_LOCK0 Configuration

#define	OTP_DATA_RAW_PAGE21_LOCK0_KEY_W																			(0x7u<<0)
#define	OTP_DATA_RAW_PAGE21_LOCK0_KEY_W_0																		(0x1u<<0)
#define	OTP_DATA_RAW_PAGE21_LOCK0_KEY_R																			(0x7u<<3)
#define	OTP_DATA_RAW_PAGE21_LOCK0_KEY_R_0																		(0x1u<<3)
#define	OTP_DATA_RAW_PAGE21_LOCK0_NO_KEY_STATE																	(0x1u<<6)
#define	OTP_DATA_RAW_PAGE21_LOCK0_R1																			(0xFFu<<8)
#define	OTP_DATA_RAW_PAGE21_LOCK0_R1_0																			(0x1u<<8)
#define	OTP_DATA_RAW_PAGE21_LOCK0_R2																			(0xFFu<<16)
#define	OTP_DATA_RAW_PAGE21_LOCK0_R2_0																			(0x1u<<16)
#define	OTP_DATA_RAW_PAGE21_LOCK0_NO_KEY_STATE_READ_ONLY														(0x0u<<6)
#define	OTP_DATA_RAW_PAGE21_LOCK0_NO_KEY_STATE_INACCESSIBLE														(0x1u<<6)

// PAGE21_LOCK1 Configuration

